app/views/messages/_form.html.erb

  <div class="field">
    <%= f.select :user_id, User.all.collect { |u| [ u.name, u.id ] } %>
---
SELECT "users".* FROM "users"