app/controllers/messages_controller.rb

  def index
    if @user_id = params[:user_id]
      @user = User.find_by(id: @user_id)
      @messages = Message.where(user_id: params[:user_id])
    else
      @messages = Message.all
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "messages".* FROM "messages"

  def show
    @message.update_column(:last_seen_at, Time.zone.now)
---
UPDATE "messages" SET "last_seen_at" = '2015-02-06 23:54:33.730037' WHERE "messages"."id" = 1

  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("created_at", "love_message", "tags", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-02-06 23:51:13.647604"], ["love_message", "Matt is helping me with Rails. LOVE this boy"], ["tags", "Coding"], ["updated_at", "2015-02-06 23:51:13.647604"], ["user_id", 1]]