app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "password", "photo", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-02-06 23:46:55.204313"], ["name", "Clint"], ["password", "Matt"], ["photo", "/images/clint.png"], ["updated_at", "2015-02-06 23:46:55.204313"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save